const fortunes = {
  "물병자리": [
    "당장의 어려움에 좌절하지 않는 의지가 필요한 하루입니다. 당신이 꿋꿋하게 이 하루를 보낸다면 그에 걸 맞는 성과를 기대해도 좋습니다. 운명은 자율적 의지를 최대한 존중합니다. 때문에 그 결과에 따라 때로는 선물을 안겨 주기도 하고, 책임을 묻기도 한답니다. 용기를 잃는다는 것은 패배를 의미 한답니다. 모든 덕 중에 가장 강하고 고결하고 자랑스러운 것은 바로 용기 입니다. 용기를 내십시오. 걱정할 필요가 없는 하루 입니다.",
    "부단한 노력이 요구되는 하루가 예상됩니다. 다소 힘들겠지만 당신이 수고한 만큼 응분의 성과를 기대할 수 있으니 부딪히는 모든 일에 최선을 다하시기 바랍니다. 지금은 비록 어려운 상황에 처해 있더라도 이것이 미래의 당신에게 좋은 약이 될 것입니다. 운명의 신은 당신의 인내가 결코 헛되이 되도록 하지는 않을 것입니다. 오히려 인내라는 것은 당신이 기회를 얻기 위한 한가지 기술이 될 것입니다.",
    "만족스러운 하루가 기대됩니다. 성공운이 당신을 따르는 시기입니다. 그러나 규모가 그리 크지 않습니다. 본래 소박한 성품을 가진 당신이므로 크고 화려한 규모보다는 내실을 기하는 까닭일 것입니다. 지나친 욕심을 경계하는 것, 이것이 당신의 소박한 행복의 비결일 것입니다. 직접적으로 재물이 들어오지는 않겠지만, 물건이나 맛있는 음식을 대접 받을 수 있겠습니다.",
    "선행을 베푸는 일은 특별한 계기가 주어질 때가 필요한 것이 아닙니다. 지금 당신 주변의 사람을 배려하고, 힘들어 하는 마음을 위안하는 것 역시 선행이라고 할 수 있죠. 아주 약간의 여유로도 얼마든지 당신은 사람을 배려할 수 있습니다. 행복을 멀리서 찾으려 하지 마세요. 바로 당신의 주변에서 지금도 당신을 행복하게 하고 있는 요소들이 많이 있답니다. 단지, 당신이 그것을 깨닫지 못할 뿐이죠. 큰 것만을 행복이라고 생각하는 사람은 어리석은 사람이죠. 일상에서 느낄 수 있는 행복을 생각하세요."

  ],
  "물고기자리": [
    "뜻밖의 난관에 부딪혀 해결점을 모색하는 가운데 금새 시간이 지날 것입니다. 그러나 그로 인해 자신을 찬찬히 돌아보는 계기가 마련되리라 봅니다. 기쁨이든 고난이든 운명이 내리는 삶에는 필요 없이 주어지는 시간은 없습니다. 다소 어려움이 있다 하더라도 도전해 볼만한 가치가 있습니다. 하늘은 인간이 헤쳐갈 수 없는 시련을 내리지는 않습니다. 시험을 준비하는 사람이라면 건강을 위하여 산책이라고 하는 게 좋겠습니다.",
    "이 별자리는 의외로 포부가 큰 별자리 입니다. 기회는 준비 없이는 오지 않는 법이지요. 하지만 이미 준비가 되어 있는 당신입니다. 오늘, 누군가 혹은 무엇인가가 당신에게 솔깃한 제안을 하거나 뜻밖의 손을 내밀어 올 것입니다. 준비된 당신은 그 내민 손을 잡기만 하면 되겠습니다. 사업을 하는 사람이라면 배짱을 부려도 되는 하루입니다.",
    "오늘은 물건을 사고 팔기 좋은 날이에요. 이런 저런 매매, 매수를 하다 보면 더 큰 기회가 올 것이니 시세 차익을 얻을 수 있습니다. 의외로 목돈을 얻을 수 있는 확률도 없지는 않겠군요. 재물의 흐름이 좋으니, 자신감을 가지고 활발하게 움직이세요. 가까운 곳에서 재운을 찾아보는 것이 유리합니다",
    "당신과 반대되는 소수의 의견도 존중하고, 그들의 권리를 지켜주려고 한다면 시간이 흐를수록 더욱더 많은 인망과 더불어 지혜로운 정신을 가지게 될 것입니다. 오늘은 대중의 의견에 동조하기보다 소수의 사람의 의견을 지키고, 그 사람들과 함께 하는 것이 유리한 날입니다. 오늘 많은 사람들에게 보여준 당신의 적극성과 열정은 오랜 시간 사람들의 기억에 남아있을 것입니다."
 
  ],
  "양자리": [
    "평소 잘 알고 지내던 사람에게 실망할 수 있습니다. 따라서 친구나 동료 사이를 비롯한 인간 관계에는 의리가 우선이니 잘잘못을 너무 따지지 말고 두리뭉실 슬쩍 넘기는 지혜가 필요한 하루입니다. 지나치게 이익을 다투면 보기에 좋지 않은 일이 일어나기 마련이지요. 누구라도 맞대고 싸우기보다 적당히 양보할 수 있는 마음의 여유가 필요합니다. 상대방을 압도적으로 눌러 이긴다고 해도 당신에게 이로울 것은 결코 없을 것이기 때문입니다.",
    "오늘은 강한 의지와 인내가 필요한 하루입니다. 한 때 곤란이 예상되지만 의지가 확고하다면 거뜬히 헤쳐나갈 수 있을 것입니다. 고난은 그것을 두려워하는 사람에게는 군림하지만 그에 대항하는 사람에게는 한발 물러서는 법이니까요. 강한 의지력을 키우는 확실한 방법은 자기절제이며 긍정적인 자기 암시 입니다. 힘이 드는 순간, 파이팅! 을 한 번 외쳐 보세요. 절대 넘어지지 않습니다. 그리고 당신은 낚싯대를 던져놓고 준비하고 있으면 됩니다. 오늘의 곤란 뒤에 곧 희망의 물고기가 당신의 준비된 낚싯대를 물을 테니까요.",
    "노력에 비해 성과가 미미할 수 있습니다. 이러한 경우에는 크게 개의치 않는 것이 현명하리라 봅니다. 뜻밖의 수확으로 횡재하는 날이 있는가 하면 못 미치는 결과에 실망스러운 날도 있기 마련이지요. 당신의 노력을 경제적으로 활용하기 위해서는 좀 더 신중한 일 처리가 필요합니다. 또는 가까운 사람보다는 조금 거리가 있는 사람에게서 조언을 듣는 것이 나을 수도 있습니다.",
    "제안이 들어오거나 약속이 잡혔는데 미처 준비가 덜되어 이런저런 핑계로 미루게 되네요. 하지만 당당하게 맞닥뜨리는 것이 좋겠습니다. 최선을 다한 후 결과에 승복하는 것은 아름다운 미덕 아닐까요? 오후 늦게 서야 사막에서 물을 만난 듯 일이 순조롭게 풀리기 시작할 것입니다. 끝까지 용기를 잃지 않고 최선을 다하는 삶의 자세가 중요함을 다시 한 번 절감할 것입니다."

  ],
  "황소자리": [
    "당장의 어려움에 좌절하지 않는 의지가 필요한 하루입니다. 당신이 꿋꿋하게 이 하루를 보낸다면 그에 걸 맞는 성과를 기대해도 좋습니다. 운명은 자율적 의지를 최대한 존중합니다. 때문에 그 결과에 따라 때로는 선물을 안겨 주기도 하고, 책임을 묻기도 한답니다. 용기를 잃는다는 것은 패배를 의미 한답니다. 모든 덕 중에 가장 강하고 고결하고 자랑스러운 것은 바로 용기 입니다. 용기를 내십시오. 걱정할 필요가 없는 하루 입니다.",
    "다른 사람을 배려하고, 겸손한 마음 가짐을 잊지 않는다면 당신의 모습에 많은 사람이 감동을 받게 됩니다. 좋은 인연이란, 노력과 정성이 잘 융화될 때 얻어질 수 있는 것이죠. 일상에서 벗어나서 충분한 휴식을 취하고, 심신을 재충전해야 하는 시기이기도 합니다. 힘찬 도약을 위해 잠시나마 긴장을 풀고, 편안한 마음가짐으로 휴식 시간을 갖도록 하세요. 머지 않나 여유와 풍요를 얻기 위해 노력해야 할 시기가 올 것입니다.",
    "당신이 해온 일이 비로소 결실을 맺게 될 것입니다. 기대에 미치지 못하는 결과가 나왔다면 실망하기 이전에, 당신의 노력을 겸허히 반성해봐야 합니다. 운이 좋아 보이는 동료의 성취는, 사실 그 이면에 무수한 인고의 노력이 있었다는 사실을 알게 될 것입니다. 노력은 언젠가 반드시 그 정당한 대가를 지불합니다.",
    "이번 달은 신중한 결단이 필요한 시기가 될 것입니다. 본인의 인생에 있어 중요한 계시가 될 수도 있습니다. 직장인이라면 회사에서 중요한 시기로 무엇이든 선택을 해야 할 시간이 온다면 두 번,세 번 신중히 생각하고 변수 등을 꼼꼼히 체크해 보시기 바랍니다. 또한 학습능력이 매우 좋은 시기입니다. 적당한 긴장감,차가운 두뇌 등 공부에 필요한 최적의 요건이 다 갖춰졌습니다. 남은 것은 스스로의 노력뿐 이니 의지를 굳게 하고 주변의 유혹에 넘어가지 않으시길 바랍니다. 날씨와도 상관없이 공부하기 좋은 달 입니다."

  ],
  "쌍둥이자리": [
    "겸허한 생활을 요구하는 한 주입니다. 주위에 유난히 일도 많고 문제도 많은 주간이 예상됩니다. 적극적으로 나서기보다 배후에서 꼼꼼히 일을 살피는 것이 더 유리할 것입니다. 다른 사람들의 이야기에 솔깃하거나 순간적인 충동으로 유혹에 섣불리 손 내밀지 않도록 스스로 삼가고 절제하시기 바랍니다.",
    "이성을 대할 때 평소와 다르게 적극적이지 못할 수 있습니다. 우유부단해지기 쉬운 달입니다. 연인과 함께 만날 때 상대방의 결정에 의존하는 경우가 빈번해지기도 합니다. 배려라기 보다는 의존에 가깝겠습니다. 좀 더 적극성을 띨 필요가 있습니다. 또한 주변이 어수선할 수 있는데 이럴수록 환경의 변화에 더욱 신경을 써야 할 시기이겠습니다. 좋은 기회가 될 수 있습니다. 만약 해야 할 일이 있다면 빠른 시간 내에 끝내는 게 이롭겠네요.",
    "당신이 열심히 뛰어다닌 만큼 성과가 보장되는 하루입니다. 자신의 능력이 충분히 발휘되는 기회나 때는 우리 인생에서 그리 잦은 선물이 아닐 것입니다. 또한 운명은 능동적인 사람에게 보다 너그러운 법이니까요. 그 성과의 크고 작음을 떠나서 주위 사람들에게 최소한의 인정을 받을 수 있다는 것만으로도 정말 기분 좋은 일일 것입니다. 마케팅을 하는 사람이라면 상대에게 대안을 주고 고르게 해야 할 것입니다.",
    "힘들고 어렵게만 느껴지는 지금이 오히려 당신을 위한 최상의 기회입니다. 지금까지 갈고 닦아온 당신의 재주를 모두 발휘하세요. 인간관계 또한 마찬가지로, 지금의 불화가 오히려 서로를 더 깊이 이해할 수 있도록 도와줄 것입니다. 당신의 솔직하고 용기 있는 태도가 필요한 시기입니다. 비가 오고 나면 땅이 더 단단히 굳어지듯, 지금의 시련은 당신을 좀더 강하게 만들고 당신의 관계를 더 친밀하게 해줄 것입니다."

  ],
  "게자리": [
    "들어오는 재물과 나가는 재물이 비슷하겠습니다. 비싼 물건을 살 수 있는데 만약 충동적인 구매라 생각이 들면 안 하시는 게 좋겠습니다. 매매 할 일이 있다면 계획대로 진행하면 됩니다. 한 달을 지나는 기간 동안 전반은 지출의 시기고 나머지 기간은 수입이 유리한 시기이니 염두 해 두시길 바랍니다. 일상 생활을 할 때에는 계단이나 비탈진 곳을 조심하시고,등산 같은 활동은 되도록 삼가는 것이 좋을 것입니다. 급작스런 움직임이 없어야 좋은 달이 되겠습니다.",
    "본인의 의도와는 상관없이 한 말이나 행동들이 대중의 주목을 받는 하루입니다. 타인에 의해서 판단이 되어지고 생각이 되어지는 관념의 허상에서 자유로워야만이 마음의 안정을 유지할 수 있습니다. 따라서 말이나 행동을 최대한 주의하되 타인의 이목에는 너무 신경 쓰지 않는 것이 좋습니다. 있어야 할 자리에 있지 못하니 아쉬우며 홀로 광채를 발하나 어느 누구도 그 가치를 알아주지 않는군요. 그래도 끝까지 참고 인내하는 것이 낫겠습니다.",
    "사소한 것일지라도, 일단 약속을 했다면 지키는 것이 좋은 한 주입니다. 가까운 사람과의 약속은 어기더라도 뒤탈이 없을 거라고 쉽게 믿어버리나, 자그마한 배신이 쌓이고 쌓이면 상대는 당신을 신뢰하지 않게 될 것입니다. 가까운 사람일 수록 약속의 이행이 중요하니 신뢰는 늘 신뢰로서 답해야 하기 때문입니다. 설령 부부사이라 할지라도 한번 한 약속은 무슨 일이 있어도 지키려 하는 자세가 필요합니다.",
    "자신이 속해 있는 팀이나 조직에서 이동하게 될 일이 생길 수도 있는 달입니다. 자신이 이루려는 목표를 향해 원하는 곳으로 이동할 수 있는 좋은 기회의 달이 될 것입니다. 당신의 능력과 적성을 잘 살릴 수 있는 기회입니다. 허나 다급하게 움직이기 보다는 차분한 움직임이 좋겠습니다. 한편으로는 여러 사람과 함께 보내야 하는 시간이 많아지는데 마음이 맞는 듯 하면서도 관계가 틀어지는 경향이 다분하니,신중하게 교류하시면 문제 될 것은 없습니다."

  ],
  "사자자리": [
    "재물이 당신과 함께 하니 자신의 직감을 믿고 소신대로 움직이세요. 투자가 큰 행운을 가져다 주는 날입니다. 약간의 용기를 내어 투자한다면 금전상의 이득을 크게 볼 수 있습니다. 주변 사람들이 해주는 말은 그리 영양가가 없습니다. 당신이 직접 겪었던 경험치가 더 큰 효력을 발휘할 것입니다.",
    "아무것도 손에 잡히는 것이 없어서 헛되이 먼 곳을 향해 손을 뻗어 보아도 닿는 것은 없습니다. 무언가를 간절히 바라다가 마음속에 공허가 들어찼다면 당신은 그 자리에 서서 자신을 재점검할 필요가 있습니다. 쓸데없는 욕심에 사로잡혀 있었던 것이 아닌지 말입니다. 욕심에 휘둘리는 것보다는 차라리 여행이라도 떠나 자신을 정비하는 것이 낫습니다. 어서 초심으로 돌아가는 것이 좋습니다.",
    "주력 파트가 아닌 분야에서의 이익 증대가 빠르게 생겨날 수 있는 달입니다. 관련 테마로 분야를 확장 또는 진출 할 수 있겠습니다. 확장을 고민하고 있었다면 도전해 보아도 좋겠습니다. 여러 가지 방향에서 시도하는 것이 중요 할 것 같네요. 그리고 이 달은 사람을 만날 때 가급적 목적을 위한 수단으로 여기지 않는 것이 유리하겠습니다. 만약 완수 했다면 미련을 두지 마십시오. 연이 있으면 다시 만나게 됩니다.",
    "여느 때보다 좀 더 굳은 당신의 의지가 필요합니다. 용감하게 계획했던 일을 추진하시기 바랍니다. 다만 의지가 약한 인간에게는 운명이 너그럽지 못함을 염두에 두셔야 할 것입니다. 처음에는 다소 사정이 어렵고 힘들겠지만 조금만 더 참고 견디면 곧 모든 일이 잘 풀려갈 것입니다. 다만, 혼자서 허위허위 가기보다 주변의 힘겨운 이웃들과 서로 독려하면서 함께 간다면 더할 나위가 없겠지요."

  ],
  "처녀자리": [
    "당신에게는 아무런 걱정도 필요 없습니다. 평소에 바라던 일이 있다면 이번 기회를 통해 이루어질 가능성이 큽니다. 이런저런 이유로 미루고 있던 일이 있다면 한번 시도해보는 게 좋을 것입니다. 당신의 친지들은 당신을 도와줄 모든 준비를 마쳤습니다. 혼자 해내기 힘든 일이 있었다면 이번 기회에 해결하도록 하세요.",
    "만나는 이들과 서로의 생각에 차이를 느낄 수 있는 달이 되겠습니다. 진심으로 마음을 나눌 수 있는 사람을 만나기가 쉽지는 않겠네요. 자신이 맡을 수 있는 일과 맡지 못할 일의 경계를 두면서 심신을 재충전 시키면 좋겠습니다. 여가 시간이 있을 때는 잠깐이라도 근거리 여행을 다녀오는 것도 좋은 방법일 것입니다. 혹시 치아나 뼈 부분에 약간의 이상을 느꼈다면 번거롭더라도 만약에 대비한다는 생각으로 검사를 받아보는 것도 좋겠습니다.",
    "부딪히는 일 없는 순탄한 하루가 예상되는군요. 장애가 없으니 당신이 추구하는 일도 술술 잘 풀릴 것입니다. 어떠한 일이든 주어지는 일에 적극적으로 매진하시기 바랍니다. 당신의 노력이 결코 헛되지 않을 것입니다. 우연히 좋은 인연을 만날 수 있습니다. 자신이 오랜 시간 지내는 공간의 분위기를 바꾸는 것도 좋겠습니다. 만족스러운 하루를 원하신다면 만족스러운 휴식을 취해야 한답니다. 찾아 들어오는 휴식을 마다할 필요는 없습니다.",
    "얻는 것보다 잃는 것이 더 많은 한 주입니다. 그리 큰 차이는 아니니 무시해도 되겠지만 어쨌거나 당신의 금주의 손익계산서는 마이너스가 되겠군요. 게으르지 않았던 당신이 이러한 결과를 받게 된 것은 운이 나빴다기보다는 중간까지 잘 해나가다가 마지막에 긴장이 풀려 마무리에 소홀했기 때문입니다. 끝까지 최선을 다하지 않는다면 좋은 성과를 기대할 수 없으니까요."

  ],
  "천칭자리": [
    "가까운 친구로부터 어려운 부탁을 요구 받게 됩니다. 당신에게도 적지 않은 부담이 가는 것이 사실이지만,지금껏 당신을 도와주고 힘이 되어주었던 친구라면 희생을 감수하고서라도 도와주는 것이 신의에 보답하는 길일 것입니다. 당장 당신의 편의를 도모하고자 외면한다면 아마 당신에게 섭섭한 마음을 감추지 않을 것입니다. 자칫 좋은 친구를 잃게 될 수도 있으니 아무리 상황이 여의치 않더라도 도움요청에 응하는 것이 좋습니다. 지나고 나면 더욱 진득한 우정이 남을 것입니다.",
    "무언가 선택을 해야 하는 순간이 와요. 돈도 좋고 명예도 좋지만 풍부한 경험도 이에 못지않아요. 오늘은 경험이 매우 중요한 날이에요. 당신이 무언가 선택할 수 있는 상황이 오면 경험을 쌓을 수 있는 길을 택하세요. 나머지것들은 따라오게 되어있어요.",
    "뜻하지 않은 작은 행운이 기다리고 있는 한 주입니다. 별 생각 없이 참여한 이벤트에서 경품을 받게 되거나 재미 삼아 구입한 복권이 적지 않은 금액의 당첨금을 안겨줍니다. 이러한 소소한 행운들이 지루한 일상에 일탈의 자극이 되어주니 짜릿함과 행복을 느끼게 해 줄 것입니다. 작은 행운들이 작은 행복을 가져와주는 한 주가 될 것입니다. 단, 과한 욕심으로 작은 행운 마저도 잃지 말아야 할 것입니다.",
    "새롭고 좋은 보금자리로 이동할 수도 있는 달 입니다. 신상에 많은 변화가 있을 수 있습니다. 만약 선택할 수 있다면 가능한 현재의 위치와 먼 곳이 낫겠습니다. 두려워할 필요는 없겠네요. 무엇인가 하고 싶은 것이 있다면 그 곳에서 방법을 찾아낼 수 있겠습니다. 사랑에 대한 색다른 감정을 느낄 수 있는 달입니다. 커플이라면 현재의 연인에게서 혹은 연인으로 발전하고 있는 인연에게서 예전과 다른 면을 찾거나 요구하게 됩니다. 싱글이라면 이상형이 다소 바뀔 수 있게 됩니다."

  ],
  "전갈자리": [
    "무엇보다도 당신의 사랑과 정성이 요구되는 하루입니다. 처음에는 뜻밖의 문제에 부딪혀 혼란 감정을 갖게 되는 상황이 예상됩니다. 어떠한 문제든 당신이 그 문제에 애정을 가지고 최선을 다해 노력한다면 차츰 희망이 보일 것입니다. 하늘의 이치에 순종하는 사람은 살고 이치를 거스르는 사람은 망한다 하였습니다. 정성을 다하면 곧 하늘의 뜻이 어떠한 것인지 알 수 있겠습니다.",
    "동분서주하며 바쁘게 일하였는데 결국 아무것도 이루어놓은 것이 없는 한 주입니다. 당신은 의욕이 넘쳐 열심히 일하였지만 주변 상황이 여의치 않으니 안타까운 노릇이네요. 특히 어수룩한 당신의 동료들이 당신이 겨우 쌓아놓은 것들을 거듭 허물어트려 당신을 안타깝게 만듭니다. 무엇보다 의욕이 없는 사람들을 데리고 일을 도모한다는 것이 얼마나 힘든 일인지 깨닫게 될 것입니다.",
    "합리적으로 결정하고,일정한 틀의 흐름에 맞춰서 질서를 유지하시면 좋은 달이 되겠습니다. 이익에 대해 너무 연연하지 마세요. 직장인이라면 각종 시상이나 보너스 등에서 유리한 기운이 있는 받는 달입니다. 벅찬 문제에 부딪혔다고 해도 주변 동료의 도움으로 쉽게 해결할 수 있는 행운이 따릅니다. 자신도 모르는 실수로 인해 신뢰를 잃을 수 있으니 이럴 때 일수록 겸손이 필요한 달이기도 합니다.",
    "모든 일에는 순서가 있는 법입니다. 쉬운 것부터 하나씩 시작해보도록 하세요. 무턱대고 어려운 일을 먼저 한다면, 금방 끝낼 수 있는 일도 잘 마무리하지 못할 것입니다. 특히, 주변에 도움을 청할 수 있는 동료가 있다면, 한번쯤 당신의 부탁을 들어줄 것이니, 활용해도 될 것입니다. 머리를 잘 써야 하는 일일수록 더욱 그렇습니다. 밀렸던 재물이 들어오려 줄을 서기 시작했습니다. 준비하세요."

  ],
  "사수자리": [
    "당신에게 재정적인 도움을 요청하는 사람이 찾아오는 한 주입니다. 도와주고 싶은 마음이 없는 것이 아니지만, 상대방이 요구하는 액수가 워낙 커서 당신으로도 어쩔 수가 없겠네요. 하지만 자신의 요구의 무리함은 생각지 않고 도움을 거절하는 당신만 야속해하는 상대방 때문에 적지 않게 기분이 상하게 될 것입니다. 될 수 있으면 돈과 관련된 부탁은 모두 거절하는 것이 뒷말을 남기지 않는 한 주입니다.",
    "피부에 관심을 가져 주는 시기입니다. 스트레스로 인해 피부가 상할 수 있습니다. 피부에 접촉하는 것들에 신경을 써야 하겠습니다. 몸에 잔병은 없습니다. 불에 관련된 것은 피하시길 바랍니다. 요리를 하거나 뜨거운 음식을 옮길 때 특히 주의를 기울여야 할 것입니다. 본의 아니게 몸담고 있던 조직에서 떠나게 되는 일이 발생할 수도 있는 달입니다. 융통성의 부족이 원인일 수 있으니 약간의 자존심을 굽힌다면 문제 없이 넘어갈 수 있는 상황입니다.",
    "당신의 마음이 이르는 대로 느끼고 표현하십시오. 유난히 판단과 사고가 명석해지는 운수입니다. 그러나 기존의 질서를 크게 해치지 않고 인정할 것은 인정하는 범위 안에서 변화, 발전을 추구하는 지혜 역시 필요합니다. 그동안 당신이 해왔던 일이나 이루어 놓은 업적들이 사람들에게 좋은 평가를 얻게 되니 이제 그 풍요로운 결실을 거두어 들이는 일만 남았습니다.",
    "평소에는 중요하게 생각하지 않았던 사물이나 사람의 가치가 눈에 들어옵니다. 때문에 간혹 흥분하거나 소란스러워질 우려가 있습니다. 그러나 새로이 드러나는 가치는 본인이 활용할 수 있는 성질의 것이 아닙니다. 이를 교훈 삼아 주위의 동료나 사물의 가치를 다시 생각해 보는 기회로 삼으시기 바랍니다. 건강에 힘을 써야 하는 시기이기도 합니다. 건강한 정신은 건강한 육체에서 나옵답니다. 건강한 육체를 위해서 휴식은 필수입니다."
    
  ],
  "염소자리": [
    "초반에는 썩 좋은 일이 생기지 않습니다. 시끌벅적한 주변의 사건에 휘둘리지 말고 자기가 맡은 일을 성실히 한다면 이 달의 흐름을 당신이 원하는 좋은 흐름으로 바꾸어 마무리 지을 수 있을 것입니다. 타고난 리더쉽을 발휘하여 다른 사람으로 하여금 저 사람과 같이 일하고 싶다 라는 생각을 들게 행동 하십시오. 그러한 행동이면 소기의 목표를 달성할 수 있습니다.",
    "현재의 상황이 몹시 어렵게 느껴질 것입니다. 희망과 의지가 필요한 하루가 될 것입니다. 더욱이 하늘은 인간이 감당할 수 있는 역경만을 내린다지 않습니까? 또 시련 끝에는 좋은 날도 오기 마련이지요. 실망하기보다 발전을 위한 부단한 노력이 더욱 필요한 날이 될 것입니다. 쓰러질 때마다 반드시 일어나십시오. 계속 쓰러져 있으면 곧 밟힌답니다. 자영업자라면 감정을 통제할 필요가 있습니다. 이 별자리는 오늘 집으로 일찍 귀가하는 게 상책입니다.",
    "누군가 당신을 조정하려 하고 있습니다. 사사건건 동료들과 충돌이 일어나니 상처만 가득한 한 주입니다. 혼자 있을 때는 몸을 조심하고 남과 같이 있을 때는 말을 조심하는 게 좋겠습니다. 이성과의 좋은 만남은 예상되나 다음으로 미루는 게 신상에 유리합니다. 사랑할 용기가 있는 당신이라면 잠시의 기다림을 견딜 만한 용기도 있다는 것입니다. 이번주의 안 좋은 기운이 이성에게 전해질 수 있기 때문입니다.",
    "그동안 열심히 노력해 왔는데 생각보다 성과가 안 나오던 사람이나,주위 사람에게 신경을 열심히 썼는데도 불과하고 냉대를 받았던 사람에게 그동안의 노력에 대한 보답이 있는 달입니다. 지금까지의 섭섭한 감정을 단숨에 날려버릴 수 있을 정도로 당신의 노력이 보상을 받습니다. 우연하게 만나는 사람으로 인하여 일이 잘 풀리기도 하지만 간혹 방해가 되어 잘 나가던 일도 잘 못 풀리기도 합니다. 이럴 때 일수록 당신보다 못한 사람을 생각하면서 도움을 줄 수 있으면 도움도 주면서 살아가는 지혜가 필요합니다."
  ]
};

// 별자리 별로 선택된 랜덤 데이터를 저장하는 객체
let selectedFortunes = {};

// 별자리를 인자로 받아 해당 별자리의 운세를 보여주는 함수
//starbox 요소를 표시하고, 선택된 랜덤 데이터가 있는 경우 저장된 값을 
//사용하고, 그렇지 않은 경우 운세 데이터를 랜덤으로 선택하여 표시.
function showStarBox(starSign) {
  const starbox = document.getElementById("starbox");
  starbox.style.display = "flex";

  let randomFortune;

  // 이미 선택된 랜덤 데이터가 있는 경우 저장된 값을 사용
  if (selectedFortunes.hasOwnProperty(starSign)) {
    randomFortune = selectedFortunes[starSign];
  } else {
    const starFortunes = fortunes[starSign];
    const randomIndex = Math.floor(Math.random() * starFortunes.length);
    randomFortune = starFortunes[randomIndex];
    // 선택된 랜덤 데이터를 저장
    selectedFortunes[starSign] = randomFortune;
  }

  document.getElementById("starbox-title").textContent = starSign;
  document.getElementById("starbox-fortune").textContent = randomFortune;
}

//뒤로가기 함수
function goBack() {
  const starbox = document.getElementById("starbox");
  starbox.style.display = "none";
}

//객체를 초기화하는 함수
//확인하기" 버튼들에 이벤트 리스너 추가: 각 버튼에 클릭 이벤트를 
//추가하여 해당 별자리를 인자로 showStarBox() 함수를 호출
function resetSelectedFortunes() {
  selectedFortunes = {};
}

document.getElementById("goBackBtn").addEventListener("click", function () {
  goBack();
});

// "확인하기" 버튼들에 이벤트 리스너 추가
const confirmBtns = document.getElementsByClassName("confirm-btn"); //confirm-btn 클래스를 가진 모든 요소를 선택하여 confirmBtns 변수에 저장
for (let i = 0; i < confirmBtns.length; i++) { //for 루프를 사용하여 각 confirmBtns 요소에 대해 클릭 이벤트 리스너를 추가
  confirmBtns[i].addEventListener("click", function () { //confirmBtns[i] 요소에 대해 익명의 함수를 이벤트 리스너로 추가
    //이벤트 리스너 함수는 클릭 이벤트가 발생했을 때 실행
    const starSign = this.dataset.starSign; //이벤트 리스너 함수 내부에서 this는 현재 클릭된 요소를 참조
    //this.dataset.starSign을 사용하여 클릭된 요소의 data-star-sign 속성 값을 가져옴. 이 값은 별자리의 이름을 나타냄.
    showStarBox(starSign); //showStarBox() 함수를 호출하여 해당 별자리의 운세를 표시
  });
}

// 자정에 selectedFortunes 초기화
function initializeSelectedFortunes() {
  resetSelectedFortunes();
}

// 매일 자정에 selectedFortunes 초기화
//setMidnightTimer 함수는 자정 타이머를 설정하는 역할
function setMidnightTimer() {
  const now = new Date(); //현재 시간을 나타내는 now 변수를 생성

  //now 변수를 기반으로 다음 자정의 시간을 나타내는 nextMidnight 변수를 생성
  //now.getFullYear()는 현재 연도, now.getMonth()는 현재 월, now.getDate() + 1는 다음 날짜를 의미하며, 시간은 0시 0분 0초로 설정
  const nextMidnight = new Date(now.getFullYear(), now.getMonth(), now.getDate() + 1, 0, 0, 0);

  //nextMidnight와 now의 차이인 timeUntilMidnight 변수를 계산.
  const timeUntilMidnight = nextMidnight - now;

  //setTimeout 함수를 사용하여 일정 시간이 경과한 후에 실행되는 함수를 설정
  setTimeout(function () {
    //일정 시간 경과 후 아래의 함수들이 호출 이때는 자정이 되었을 때.
    initializeSelectedFortunes();
    setMidnightTimer();
  }, timeUntilMidnight);
}

// 자정 타이머 설정
setMidnightTimer();

/* 해당 코드는 각 각의 별자리별 "확인하기" 버튼을 눌렀을 때 저장된 랜덤한 값들이 출력된다.
이때 부여받은 랜덤한 데이터는 selectedFortunes에 저장하며 하루 동안은 선택된 랜덤 객체가 나온다.
이는 자정에 초기화 되며 하루마다 새로운 랜덤 데이터들이 출력된다.
*/